app/controllers/api/v1/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 245], ["LIMIT", 1]]
---
	def show
		@posts = Post.find(params[:id])

INSERT INTO "posts" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Lorem ipsum dolor sit amet"], ["created_at", "2024-07-01 04:18:37.703401"], ["updated_at", "2024-07-01 04:18:37.703401"]]
---
	def create
		@posts = Post.new(user_id: session[:user_id], description: params[:description])
		if @posts.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 AND "posts"."user_id" IS NULL ORDER BY "posts"."id" ASC LIMIT $2  [["id", 83], ["LIMIT", 1]]
---
	def update
		@posts = Post.where(id: params[:id], user_id: session[:user_id]).first

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 327], ["LIMIT", 1]]
---
	def destroy
		@posts = Post.where(id: params[:id], username: params[:username], password: params[:password],
			email: params[:email], phone_no: params[:phone_no]).first