app/controllers/api/v1/users_controller.rb

	def index
		@users = User.all
---
SELECT  `users`.* FROM `users` WHERE (tokenid = '5205f354-8c0a-45af-8c13-c74e9bf55d7b')  ORDER BY `users`.`id` ASC LIMIT 1

	def show
		@users = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 281], ["LIMIT", 1]]

	def request_token
		@users = User.where('email = ? AND password = ?', params[:email], params[:password]).first
---
SELECT  `users`.* FROM `users` WHERE (email = NULL AND password = NULL)  ORDER BY `users`.`id` ASC LIMIT 1

	def create
		@users = User.new(username: params[:username], password: params[:password],
			email: params[:email], phone_no: params[:phone_no],tokenid: session[:tokenid])
		@users.tokenid = SecureRandom.uuid
		if @users.save
---
INSERT INTO `users` (`username`, `password_digest`, `email`, `tokenid`, `created_at`, `updated_at`) VALUES ('dhanar', '$2a$10$tCA92RMsMcM/rnfT4b6sbOwQRrr79IZ5lhbjvyl7VIWH9y1jayBci', 'aku@mail.com@phone_no=4321', 'a19b7387-2cc1-4435-93c1-b0b9390911fa', '2017-10-02 13:27:41', '2017-10-02 13:27:41')

	def update
		@users = User.where(id: params[:id]).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 585], ["LIMIT", 1]]

	def destroy
		@users = User.where(id: params[:id]).first
		if @users.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 503], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 503]]

	def set_user
		@user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE (tokenid = '75660ebb-d88d-4510-b071-e11f4d735416')  ORDER BY `users`.`id` ASC LIMIT 1