app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`tokenid`, `username`, `password`, `email`, `phone_no`, `created_at`, `updated_at`) VALUES ('1', 'agus', 'agus', 'agus@mail.com', '1245678', '2017-09-24 15:53:59', '2017-09-24 15:53:59')